In [1]:
import pandas as pd

In [2]:
# Create a sample DataFrame
data = {'full_name': ['Michael Johnson', 'Sarah Williams', 'David Brown', 'Emily Davis', 'Jessica Wilson']} 
df = pd.DataFrame(data)
df

         full_name
0  Michael Johnson
1   Sarah Williams
2      David Brown
3      Emily Davis
4   Jessica Wilson

In [3]:
# Use the str.split method to split the data based on spaces
df[['first_name', 'last_name']] = df['full_name'].str.split(' ', expand=True)
df

         full_name first_name last_name
0  Michael Johnson    Michael   Johnson
1   Sarah Williams      Sarah  Williams
2      David Brown      David     Brown
3      Emily Davis      Emily     Davis
4   Jessica Wilson    Jessica    Wilson

In [4]:
data = {'full_name': ['Michael John son', 'Sarah Williams', 'David Br own', 'Emily Davis', 'Jessica Wilson']} 
df = pd.DataFrame(data)
df

          full_name
0  Michael John son
1    Sarah Williams
2      David Br own
3       Emily Davis
4    Jessica Wilson

In [5]:
# limit splitting timtes to 1 
df[['first_name', 'last_name']] = df['full_name'].str.split(' ', expand=True, n=1)
df

          full_name first_name last_name
0  Michael John son    Michael  John son
1    Sarah Williams      Sarah  Williams
2      David Br own      David    Br own
3       Emily Davis      Emily     Davis
4    Jessica Wilson    Jessica    Wilson